.metadata/.plugins/org.eclipse.core.resources/.history/d8/c074a5472cc5001a15f09b28feee9cd4

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo">
            <sCountryISOCode>US</sCountryISOCode>
        </CapitalCity>
    </Body>
</Envelope>