DEMOAPIProject/PractiseFiles/DemoPractise1.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <FullCountryInfo xmlns="http://www.oorsprong.org/websamples.countryinfo">
            <sCountryISOCode>IN</sCountryISOCode>
        </FullCountryInfo>
    </Body>
</Envelope>