SoapRequest/Country.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <CapitalCity xmlns="http://www.oorsprong.org/websamples.countryinfo">
            <sCountryISOCode>AR</sCountryISOCode>
        </CapitalCity>
    </Body>
</Envelope>